package UIConsole;

import java.time.Year;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Scanner;
import Note.Note;
import FileWork.FileWork;

import javax.xml.crypto.Data;

public class UIConsole {
    static String[] names = new String[] {"Мария", "Лада", "Людмила", "Ксюша", "Анфиса", "Ксения", "Игорь", "Савва", "Мастурбек", "Марфа", "Ростислав", "Геннадий", "Мира", "Всеволод", "Юрий", "Альбина", "Трофим", "Фаддей", "Власта", "Сильвестр", "Прохор", "Евсей", "Владислав", "Тихомир", "Злата", "Севастьян", "Мстислав", "Лука", "Марта", "Анфим", "Остап", "Климент", "Аглая", "Ярополк", "Аким", "Роза", "Дмитрий", "Андрей", "Евгений", "Дарья", "Егор", "Анна", "Иван", "Софья", "Милана", "Полина", "Веселина", "Александр", "Антон", "Аристарх", "Никанор", "Карп", "Силантий", "Глеб", "Ирина", "Тимур", "Ангелина", "Арлан", "Камилла", "Лучезар", "Любовь", "Кира", "Дарина", "Борис", "Алиса", "Елизавета", "Амир", "Тамара", "Влад", "Кирилл", "Арина", "Матвей", "Даша", "Игнат", "Артём", "Инкар", "Таня", "Альтаир", "Виолетта", "Роксана", "Артемида", "Виталина", "Анастасия", "Виктория", "Мирабелла", "Ярослав", "Олег", "Карина", "Алёна", "Дима", "Евдокия", "Алина", "Ева", "Есения", "Илья", "Сергей", "Амина", "Елисей", "Ксюнечка", "Добрыня", "Аскольд", "Лариса", "Любава", "Филипп", "Зоя", "Данил", "Вика", "Соня", "Даниил", "Светлана", "Фёдор", "Катя", "Надежда", "Сабина", "Лера", "Юна", "Вероника", "Варвара", "Алла", "Денис", "Яся", "Влада", "Арайлым", "Йоши", "Сумая", "Ясон", "Макар", "Марк", "Селивёрст", "Майя", "Гликерия", "Агата", "Сияна", "Розалия", "Камила", "Снежана", "Вячеслав", "Стелла", "Инга", "Елена", "Дио", "Василий", "Оксана", "Олеся", "Бандера", "Адия", "Инна", "Жания", "Валерий", "Аянат", "Диана", "Татьяна", "Сафина", "Милада", "Мирослава", "Лукерья", "Фома", "Луна", "Маргарита", "Илария", "Валерия", "Зинаида", "Роман", "Лия", "Рома", "Варя", "Элеонора", "Томирис", "Кристина", "Сильва", "Максим", "Настя", "Милена", "Алеся", "Хеда", "Алдияр", "Нурай", "Ясина", "Хайдар", "Аяулым", "Мээрим", "Саян", "Айдай", "Селена", "Мерей", "Артем", "Мстислава", "Филат", "Антонина", "Лаура", "Вениамин", "Мухаммад", "Демьян", "Святослав", "Айдана", "Доминика", "Лана", "Иннокентий", "Лилия", "Тихон", "Мартина", "Владимир", "Яков", "Вера", "Евсевий", "Марина", "Юлия", "Аксиния", "Екатерина", "Богдан", "Назар", "Ясна", "Лиза", "Заряна", "Галина", "Пётр", "Тимофей", "Виктор", "Фатима", "Ольга", "Николай", "Хару", "Юля", "Малика", "Асма", "Нуржигит", "Никита", "Степан", "Олжас", "Аня", "Нуртилек", "Жаркынай", "Арууке", "Алуа", "Нурайым", "Ваня", "Ярослава", "Радна", "Яанус", "Арсений", "Гей", "Каллистрат", "Айрис", "Любомира", "Лох", "Эвелина", "Ладомира", "Каролина", "Василиса", "Александра", "Альберт", "Мадина", "Михаил", "Алевтина", "Георгий", "Уна", "Филомена", "Алексей", "Таисия", "Раяна", "Самира", "Хyй", "Константин", "Шерзод", "Нигина", "Шахноза", "Хамза", "Дилдорбек", "Аббасали", "Шахризода", "Аслан", "Адина", "Сара", "Маша", "Юки", "Руслан", "Алибек", "Азамат", "Дидар", "Айман", "Ясик", "Рамир", "Амелия", "Акерке", "София", "Каталея", "Хадиджа", "Сухроб", "Макс", "Захар", "Бегимай", "Азирет", "Акниет", "Субин", "Неля", "Мухаммадали", "Аксезим", "Стася", "Вега", "Робия", "Аграфена", "Старла", "Жизель", "Алинур", "Кутман", "Фаина", "Елигай", "Аида", "Майрбек", "Феодора", "Акнур", "Глория", "Натали", "Звезда", "Эльмаз", "Наташа", "Махди", "Роксолана", "Герман", "Лусине", "Шамиль", "Сергия", "Дария", "Данила", "Домника", "Викентий", "Лена", "Гавриил", "Радослав", "Рано", "Рина", "Станислав", "Архипп", "Вадим", "Наталья", "Артур", "Оливия", "Виталий", "Амаль", "Яна", "Саят", "Изель", "Арнат", "Ализа", "Самир", "Муса", "Лиана", "Нурзат", "Нурдана", "Рей", "Мартин", "Мия", "Аина", "Ванесса", "Алия", "Жасмин", "Аврора", "Кассандра", "Линара", "Булат", "Дура", "Азалия", "Арсен", "Семён", "Лилит", "Диас", "Гриша", "Пантелей", "Марьяна", "Анель", "Сезим", "Костя", "Мафтуна", "Лейла", "Мехрона", "Айсулу", "Дамир", "Амалия", "Нурболот", "Лорс", "Дильбар", "Хусан", "Каныкей", "Медер", "Ажар", "Молдир", "Муниса", "Рухшона", "Альмина", "Азема", "Камолиддин", "Фидан", "Улдана", "Дилноза", "Мирай", "Леля", "Хикару", "Раатбек", "Ахрор", "Дониер", "Наби", "Дилдора", "Эльхан", "Эрэл", "Жыргалбек", "Назерке", "Жанерке", "Аделина", "Шугыла", "Сунатулло", "Арай", "Эмир", "Самия", "Айым", "Джейхун", "Мефодий", "Наталия", "Раян", "Анжела", "Демид", "Аманта", "Канышай", "Толганай", "Данис", "Василина", "Ильяс", "Ислам", "Савира", "Фелиса", "Альфия", "Радмир", "Мирослав", "Юра", "Павел", "Тансулпан", "Софа", "Бека", "Рен", "Эрик", "Назым", "Сяо", "Жади", "Корнелий", "Аллах", "Ульяна", "Журава", "Анеля", "Камира", "Мэри", "Дина", "Сафия", "Замира", "Махина", "Изабель", "Диляра", "Макка", "Фарзона", "Яфит", "Табита", "Нетали", "Ляля", "Камелия", "Мелисса", "Аника", "Адриана", "Айка", "Шабнам", "Эволет", "Тиана", "Лаймдота", "Леся", "Нонна", "Хитоми", "Айгун", "Инесса", "Айрин", "Турпал", "Сева", "Райден", "Гульжамал", "Евгения", "Франсуаза", "Фаиз", "Ставр", "Фаиза", "Амрит", "Зарема", "Серафима", "Фуад", "Ыза", "Лура", "Ильдар", "Пон", "Кларисса", "Бейбарыс", "Родион", "Параша", "Серебряна", "Арнольд", "Нина", "Илона", "Марсель", "Адилям", "Феликс", "Зейнаб", "Леон", "Эсмеральда", "Зухра", "Луиза", "Герта", "Адель", "Адам", "Соля", "Анжелина", "Сила", "Валентина", "Эмма", "Лидия", "Маргулан", "Циля", "Анелия", "Бек", "Анатолий", "Коко", "Адольф", "Россия", "Амре", "Иляна", "Рушана", "Аруна", "Нуъмон", "Аделия", "Хилола", "Адилет", "Аян", "Шахзод", "Шахбоз", "Эсма", "Радмила", "Данте", "Гейлорд", "Эллада", "Тори", "Айханым", "Инжу", "Эльдияр", "Света", "Далия", "Тигран", "Жаслан", "Вада", "Айсана", "Мари", "Гулсанам", "Махбубахон", "Асланбек", "Ахлиддин", "Дилбек", "Аброр", "Самина", "Жанарыс", "Эмиль", "Фидан", "Дэвид", "Хадя", "Шохруз", "Улан", "Гарик", "Ильназ", "Меруерт", "Ернар", "Мадияр", "Мавзуна", "Аяла", "Ниджат", "Рукия", "Зере", "Ахмад", "Ансар", "Эльза", "Арташес", "Тамир", "Арби", "Элдияр", "Асет", "Элиф", "Раиса", "Нурлыжан", "Ясения", "Зарат", "Миша", "Асмира", "Ясмина", "Жаныл", "Николь", "Фаромарз", "Аймира", "Дания", "Ернур", "Алика", "Эхсон", "Даниял", "Женя", "Насиба", "Наркас", "Ырыскелди", "Нарек", "Дияз", "Ксеня", "Ырысбек", "Рамина", "Азизбек", "Асылжан", "Хагани", "Нурымжан", "Назлы", "Ариет", "Жибек", "Сирожиддин", "Аюр", "Жавохир", "Анифе", "Аяна", "Омурбек", "Дилмурод", "Айкен", "Зайнаб", "Шохрух", "Айзере", "Эрлан", "Сабрина", "Вова", "Каракат", "Зубайр", "Согдиана", "Умут", "Назим", "Акпейил", "Адиз", "Рысбек", "Бурулай", "Салтанат", "Эламан", "Касиет", "Айару", "Мади", "Вачик", "Айтурган", "Айгерим", "Гулдана", "Бекмырза", "Гулсезим", "Гурген", "Суман", "Шурка", "Ойбек", "Айсанем", "Асадуллах", "Лёля", "Бекзод", "Хариса", "Сансет", "Аура", "Нафсет", "Севериан", "Анара", "Салман", "Эрна", "Садако", "Алана", "Лида", "Мурок", "Абдурахман", "Ибрагим", "Джонибек", "Мусик", "Ларина", "Камиля", "Сиара", "Иляс", "Любомир", "Шохона", "Эльнур", "Хрисанта", "Сандра", "Муслим", "Шуана", "Эдие", "Дастан", "Хината", "Атанасия", "Эбони", "Ниса", "Максалина", "Млада", "Даниз", "Нодир", "Мисти", "Мамур", "Анаит", "Инал", "Камрон", "Иви", "Нурдина", "Демис", "Магидат", "Радима", "Мариса", "Эрвин", "Макетатон", "Сарвар", "Эппл", "Халина", "Сарюна", "Эсфирь", "Шер", "Смарагда", "Даздраперма", "Рулан", "Гарник", "Усаги", "Брюс", "Гияз", "Кэт", "Мирпаша", "Нарине", "Роланд", "Сигалит", "Алсу", "Ниля", "Ахуй", "Жеткер", "Ванда", "Фарман", "Раум", "Чирикли", "Мурад", "Мустафа", "Азазель", "Анетти", "Анжелика", "Соледад", "Аристина", "Изабелла", "Умугат", "Яромир", "Суэлен", "Аннабель", "Севика", "Захро", "Миная", "Ума", "Нозима", "Хикари", "Маина", "Ройя", "Азиз", "Колетт", "Альнура", "Платон", "Вивьен", "Шахризат", "Раъно", "Офелия", "Куроко", "Рудольф", "Кана", "Достонбек", "Санджи", "Старк", "Хару", "Кристалия", "Джохар", "Джузеппина", "Хабиба", "Пансемна", "Айназик", "Хаким", "Кабил", "Лина", "Шакира", "Боян", "Афродита", "Сеймур", "Ардалион", "Овхан", "Оана", "Белла", "Дезире", "Тая", "Анимаиса", "Фантазия", "Аманда", "Имран", "Онега", "Ада", "Нилуфар", "Латаша", "Азерин", "Имилия", "Афтаб", "Бегали", "Антония", "Аршак", "Чингис", "Марио", "Формоза", "Марва", "Лаванда", "Ханако", "Данелия", "Ван", "Цминда", "Рин", "Камен", "Ибтихадж", "Эллиот", "Арслан", "Дьюк", "Дора", "Пантелеймон", "Телминья", "Какаши", "Илия", "Даниэлла", "Феля", "Максат", "Ирода", "Заур", "Алира", "Сэсэгма", "Ками", "Перкосрак", "Солонго", "Мухаммед", "Павсикакий", "Ааму", "Йоланта", "Айдар", "Русь", "Мухаммадюсуф", "Элла", "Афруза", "Мавжуда", "Волга", "Бланш", "Кукша", "Лорейн", "Наиль", "Хриса", "Ерхан", "Ангела", "Розалина", "Кафка", "Коля", "Нозли", "Мане", "Туана", "Силуан", "Нета", "Эрих", "Тина", "Элиза", "Изатулло", "Жыпара", "Самсон", "Данат", "Ричард", "Фозил", "Кайрат", "Аристотель", "Галатея", "Лучезара", "Синь", "Сиэль", "Алишер", "Тарон", "Миретта", "Даян", "Маркел", "Додик", "Рамида", "Шинкори", "Капа", "Нуб", "Марбелла", "Вагинак", "Мухайё", "Амура", "Асель", "Эяль", "Гордей", "Сергиос", "Низами", "Аиша", "Айсиля", "Алисинья", "Синиша", "Закия", "Айшат", "Меружан", "Март", "Нуркелди", "Ясин", "Айгуль", "Дженнет", "Поллианна", "Рубина", "Меланиппа", "Юта", "Пальмира", "Нателла", "Абдулла", "Халя", "Эъзоза", "Сантана", "Нами", "Нюта", "Парвиз", "Захра", "Ляззат", "Рома", "Гулжан", "Алим", "Ксюндрик", "Мулиера", "Звездан", "Муся", "Фарфалла", "Манас", "Нафиса", "Хризантема", "Фросий", "Абильмансур", "Парадигма", "Шинобу", "Азура", "Дамиан", "Керемет", "Михаль", "Мастонахон", "Акат", "Весна", "Зухур", "Севинч", "Сулус", "Сунгат", "Нурмехамат", "Поппа", "Демиана", "Эзель", "Адиль", "Хосият", "Ориё", "Ренесми", "Перизат", "Палома", "Сахиба", "Дамели", "Татьтяна", "Сорча", "Цыцыгма", "Офтоб", "Гавхарой", "Дерья", "Васса", "Целестина", "Ливаза", "Фархунда", "Очир", "Рифкат", "Калеб", "Симонетта", "Нурхан", "Боми", "Сайына", "Алена", "Мерседес", "Аъзам", "Рианна", "Эзель", "Саид", "Шахризод", "Мирра", "Эстелла", "Гоша", "Амала", "Альяна", "Лика", "Опал", "Мохинур", "Майрамхон", "Бегзат", "Соро", "Марко", "Григорий", "Ника", "Талия", "Дарьяна", "Марям"};
    static String[] patronymicEnds = new String[] {"ович", "евич", "ич", "овна", "евна", "ична", "инична", "ыч"};
    public UIConsole() {

    }
    public void start(){
        System.out.println("Введите следующие данные в произвольном порядке, разделенные пробелом:\n" +
                "Фамилия Имя Отчество датарождения номер телефона пол");
        Scanner scanner = new Scanner(System.in);
//        String[] text = scanner.nextLine().split(" ");
        String[] text = scanner.nextLine().split(" ");
        boolean genderFlag = true;
        boolean dataFlag = true;
        boolean phoneFlag = true;
        boolean NameFlag = true;
        boolean patronymicFlag = true;
        String gender;
        String data;
        String phone;
        String firstname;
        String patronymic;
        String name;
        String lastname;
        Note note = new Note();
        for (int i = 0; i < 6; i++){
            if (checkGender(text[i]) && genderFlag){
                note.setGender(text[i]);
                genderFlag = false;
                continue;
            }
            if (checkData(text[i]) && dataFlag){
                note.setBirthdate(text[i]);
                dataFlag = false;
                continue;
            }
            if (checkPhone(text[i]) && phoneFlag){
                note.setPhoneNumber(text[i]);
                phoneFlag = false;
                continue;
            }
            if (checkFirstName(text[i]) && NameFlag){
                note.setName(text[i]);
                NameFlag = false;
                continue;
            }
            if (checkPatronymic(text[i]) && patronymicFlag){
                note.setPatronymic(text[i]);
                patronymicFlag = false;
                continue;
            }
           note.setLastName(text[i]);
        }
    }

    private boolean checkPatronymic(String string) {
        for (int i = 0; i < string.length(); i++) {
            if (string.contains(patronymicEnds[i])){ return true;}
        }
        return false;
    }

    private boolean checkFirstName(String string) {
        return Arrays.asList(names).contains(string);
    }

    private boolean checkPhone(String string) {
        try{
            if (0 <= Integer.parseInt(string)){return true;}
            else {return false;}
        } catch (Exception e){
            return false;
        }
    }

    private boolean checkData(String string) {
        String[] newString = string.split(".");
        try {
            if (string.length() == 10
                    && 0 < Integer.parseInt(newString[0])
                    && Integer.parseInt(newString[0]) < 32
                    && 0 < Integer.parseInt(newString[1])
                    && Integer.parseInt(newString[1]) < 12
                    && 1900 < Integer.parseInt(newString[2])
                    && Integer.parseInt(newString[2]) <= Year.now().getValue()){
                return true;
            } else {return false;}
        } catch (Exception e){
            return false;
        }
    }


    private boolean checkGender(String string) {
        if (string.equals("m") || string.equals("g")) {return true;};
        return false;
    }
}




























//    public boolean input() {
//        Scanner scanner = new Scanner(System.in);
//        String[] text = scanner.nextLine().split(" ");
//        try {
//            for (int i = 0; i < 6; i++) {
//                inputGender(text[i]);
//                if () {
//                    String gender = ;
//                } catch (){
//
//            }
//        }
//    }
//                if (gender.equals("Введите пол корректно")){
//
//                }
//
//                String name = inputString("Введите имя", 1, 30, scanner);
//                String patronymic = inputString("Введите отчество", 1, 30, scanner);
//                String surname = inputString("Введите фамилию", 1, 40, scanner);
//                String date = inputDate("Введите дату в формате dd.mm.yyyy", scanner);
//
//                String phone = inputPhone("Введите телефон", scanner);
//                String gender = inputGender("Укажите ваш пол (м/ж)",scanner);
//                if (inputGender(text[i]) == "f"){
//
//                }
//            }
//
//
//
//        Note note = new Note(name,surname,patronymic,date,phone,gender);
//        FileWork.writeNote(note);
//
//
//    public String inputGender(String string) {
//        String[] okAnswersGender = {"m", "мужской", "м", "муж", "муж.", "male", "m.", "м.", "f", "женский", "ж", "жен", "жен.", "female", "f.", "ж."};
//        String gender = string.toLowerCase();
//        int a = Arrays.asList(okAnswers).indexOf(string);
//        if (a > 7) {
//            return "f";
//        } else if (a > 0) {
//            return "m";
//        }
//        return gender;
//    }
//
//
//    private String inputPhone(String string, Scanner scanner){
//            String userString = inputString(string, 9, 14, scanner);
//            int i = 0;
//            StringBuilder stringBuilder = new StringBuilder();
//            while (true){
//                if (i == userString.length()) {
//                    return stringBuilder.toString();
//                }
//                char element = userString.charAt(i);
//                if (Character.isDigit(element)){
//                    stringBuilder.append(element);
//                } else if(element != ' ' && element != '-' && element != '*' && element != '+' && element != '.'){
//                    return "номер введён некорректно. Повторите ввод.";
//                }
//                i++;
//            }
//    }
//
//
//
//
//    private String inputDate(String string, Scanner scanner) {
//        System.out.println(string);
//        int year = checkNumber("Введите год: ", 1920, Year.now().getValue(), scanner);
//        int month = checkNumber("Введите месяц: ", 1, 12, scanner);
//        int[] days = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
//        int day = checkNumber("Введите день: ", 1, days[month-1], scanner);
//        String monthLeftZero;
//        String dayLeftZero;
//        if (month < 10){
//            monthLeftZero = "0";
//        } else {
//            monthLeftZero = "";
//        }
//        if (day < 10){
//            dayLeftZero = "0";
//        } else {
//            dayLeftZero = "";
//        }
//        return (dayLeftZero + day + "." + monthLeftZero + month + "." + year);
//        }
//
//    private int checkNumber(String question, int min, int max, Scanner scanner) {
//        while (true) {
//            System.out.println(question);
//            String res = scanner.nextLine();
//            try {
//                int resint = Integer.parseInt(res);
//                if (resint >= min && resint <= max) {
//                    return resint;
//                } else {
//                    System.out.println("Данные введены некорректно. Введите число от " + min + " до " + max);
//                }
//            } catch (NumberFormatException e){
//                System.out.println("Данные введены некорректно. Введите число");
//            }
//
//        }
//    }
//
//    private String inputString(String string, int minLength, int maxLength, Scanner scanner) {
//        while (true){
//            System.out.println(string);
//            String res = scanner.nextLine();
//            if (res.length() >= minLength && res.length() <= maxLength) {
//                return res;
//            } else{
//                return ("Данные введены некорректно. Введите от " + minLength + " до " + maxLength + " символов");
//            }
//
//        }
//    }
//}